{
  "is_mammal": "Is the animal a mammal?",
  "is_bird": "Is your animal a bird?",
  "is_reptile": "Is your animal reptilian like a snake or lizard?",
  "is_fish": "Is your animal a fish?",
  "is_amphibian": "Can it live both in water and on land?",
  "is_insect": "Is your animal an insect?",
  "is_arachnid": "Is your animal a arachnid like a spider or scorpion?",
  "is_crustacean": "Is it a sea creature with a hard shell like a crab or lobster?",
  "is_mollusc": "Does it have a soft body, maybe with a shell, like a snail or octopus?",
  "is_tiny": "Is it so small that you could hold couple of them in one hand?",
  "is_small": "Is it small enough to fit easily in your palm?",
  "is_medium": "Is it about the size of a Human or a large Dog?",
  "is_large": "Is it bigger than a person?",
  "is_very_large": "Is it very big, like an elephant or horse?",
  "is_massive": "Is it huge, bigger than most animals, like a whale?",
  "is_vertebrate": "Does it have a backbone or spine?",
  "is_warm_blooded": "Is your animal warm blooded, like humans or birds?",
  "is_aquatic": "Does it live only in the water?",
  "is_terrestrial": "Does it live mostly on land?",
  "has_lungs_for_breathing": "Does it breathe air through lungs like people?",
  "has_gills_for_breathing": "Does it breathe through gills under water?",
  "has_fur_or_hair": "Does it have fur or hair on its body?",
  "has_feathers": "Does it have feathers covering its body?",
  "has_scales": "Does it have scales like a snake or fish?",
  "has_leathery_or_slimy_skin": "Does its skin feel leathery or slimy like a frog?",
  "has_hard_exoskeleton": "Does it have a hard exoskeleton? (Think: insects, spiders, crabs, lobsters)",
  "has_shell": "Does it have a shell?",
  "is_primarily_black": "Is it mostly black in color?",
  "is_primarily_white": "Is it mostly white in color?",
  "is_primarily_brown": "Is it mostly brown in color?",
  "is_primarily_grey": "Is it mostly gray in color?",
  "is_primarily_red_or_pink": "Is it mostly red or pink in color?",
  "is_primarily_orange": "Is it mostly orange in color?",
  "is_primarily_yellow": "Is it mostly yellow in color?",
  "is_primarily_green": "Is it mostly green in color?",
  "is_primarily_blue": "Is it mostly blue in color?",
  "can_have_multi_color": "Can it come in many colors or have mixed patterns?",
  "has_wings": "Does it have wings(even if it does not fly)?",
  "has_fins": "Does it have fins to swim with?",
  "has_hooves": "Does it have hard feet called hooves like a horse or cow?",
  "has_claws_paws_or_talons": "Does it have claws, paws, or sharp grabbing feet?",
  "has_horns_or_antlers": "Does it have horns or antlers on its head?",
  "has_tusks": "Does it have long teeth or tusks like an elephant or walrus?",
  "has_distinct_beak_or_bill": "Does it have a beak or bill like a bird or duck?",
  "has_tentacles_or_arms": "Does it have tentacles or arms like an octopus?",
  "has_prehensile_tail": "Can it use its tail to grab or hold things?",
  "has_no_legs": "Does it have no legs at all, like a snake?",
  "has_two_legs": "Does it have two legs, like a human or bird?",
  "has_four_legs": "Does it walk on four legs, like a dog or cat?",
  "has_six_legs": "Does it have six legs, like most insects?",
  "has_eight_legs": "Does it have eight legs, like a spider?",
  "has_more_than_eight_legs": "Does it have many legs, more than eight, like a centipede?",
  "long_and_slender_body": "Does it have a long and slender body shape?",
  "radially_symmetrical_body": "Does it look the same in all directions from the center, like a starfish?",
  "is_semi_aquatic": "Does it live both in water and on land part of the time?",
  "is_arboreal": "Does it mostly live in trees?",
  "is_fossorial": "Does it live mostly underground or dig burrows?",
  "lives_in_marine_water": "Does it live in the salty ocean?",
  "lives_in_freshwater": "Does it live in rivers or lakes with fresh water?",
  "lives_in_polar_or_arctic_regions": "Does it live in very cold, icy places?",
  "lives_in_deserts_or_arid_regions": "Does it live in dry deserts?",
  "lives_in_forests_or_woodlands": "Does it live in forests with many trees?",
  "lives_in_grasslands_or_savannas": "Does it live in open grasslands or savanna areas, like a lion?",
  "common_in_urban_areas": "Is it often seen around cities or towns?",
  "is_carnivore": "Does it mostly eat meat(living things)?",
  "is_herbivore": "Does it mostly eat plants?",
  "is_omnivore": "Does it eat both plants and living things?",
  "is_piscivore": "Does it mainly eat fish?",
  "is_insectivore": "Does it mainly eat insects?",
  "eats_nectar_pollen_or_fruit": "Does it mostly eat nectar, pollen, or fruit?",
  "is_filter_feeder": "Does it eat tiny food from the water using filters, like a whale?",
  "is_scavenger": "Does it eat dead animals or leftovers?",
  "is_parasitic": "Does it live on or inside another animal to get food?",
  "is_nocturnal": "Is it active mostly at night?",
  "is_diurnal": "Is it active mostly during the day?",
  "is_solitary": "Does it mostly live alone?",
  "lives_in_small_groups_or_pairs": "Does it live with a mate or small family group?",
  "is_highly_social_or_eusocial": "Does it live in large, well-organized groups(colonies) like ants or bees?",
  "migrates_seasonally": "Does it travel long distances during certain times of the year?",
  "hibernates_or_enters_torpor": "Does it sleep deeply or slow down in winter or cold times?",
  "builds_complex_structures": "Does it build big or special homes like nests, hives, dams, or houses?",
  "is_bioluminescent": "Can it glow or make its own light like a firefly?",
  "can_change_color": "Can it change its color for different reasons?",
  "uses_camouflage_or_mimicry": "Can it hide or look like something else to stay safe like a Chameleon?",
  "has_venom_or_poison": "Can it bite, sting, or release poison to harm or defend?",
  "is_apex_predator": "Is it at the top of the food chain with no natural enemies?",
  "communicates_with_complex_vocalizations": "Does it make many sounds to talk or sing to others?",
  "lays_eggs": "Does it lay eggs to have babies?",
  "gives_live_birth": "Does it give birth to live babies?",
  "undergoes_metamorphosis": "Does it change shape as it grows, like a caterpillar to a butterfly?",
  "carries_young_in_pouch": "Does it carry its young in a pouch like a kangaroo?",
  "provides_extensive_parental_care": "Do the parents take care of their young for a long time?",
  "is_domesticated": "Has it been tamed or raised by people for work or as pets?",
  "is_considered_a_common_pest": "Is it often seen as a pest that bothers people or crops?",
  "causes_diseases": "Can it spread diseases to people or other animals?",
  "is_symbol_of_a_nation_or_state": "Is it used as a national or state symbol?",
  "is_featured_in_religious_texts": "Is it mentioned in holy or religious stories?",
  "is_mythological_or_fictional": "Is it a creature from stories, myths, or movies?",
  "is_extinct_or_prehistoric": "Is it prehistoric or extinct like a dinosaur or a tasmanian tiger?",
  "is_major_focus_of_ecotourism": "Do people travel to see it in the wild?",
  "is_famous_pop_culture_character": "Is it famous in cartoons, movies, or books?"
}
